Documents/ESB/ESB_Consumer_0525/003TestSample/SAMPLE_XML_MUST/TDAccount/TD07_TDAcctOpnRq.xml

<?xml version="1.0" encoding="utf-8"?>

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:v1="http://www.iisigroup.com/magiclamp/common/soapenv.xsd/v1" xmlns:v11="http://www.nextbank.com.tw/xsd/TW/TDAccount/TDAcctOpnRq/v1">  
  <soap:Header> 
    <v1:Header v1:mustUnderstand="true"> 
      <ChannelID>ESB</ChannelID>  
      <ServiceDomain>TDAccount</ServiceDomain>  
      <OperationName>TDAcctOpn</OperationName>  
      <ConsumerID>TWESB</ConsumerID>  
      <TransactionID>T1222222</TransactionID>  
      <RqTimestamp>2015-12-06T12:01:01.00+08:00</RqTimestamp> 
    </v1:Header> 
  </soap:Header>  
  <soap:Body> 
    <v11:TDAcctOpnRq> 
      <v11:ServiceHeader> 
        <v11:TxnId>TD07</v11:TxnId>  
        <v11:TxnNo>TD0700001</v11:TxnNo> 
      </v11:ServiceHeader>  
      <v11:Signon> 
        <v11:CustId>ESBUSER</v11:CustId> 
      </v11:Signon>  
      <v11:ServiceBody> 
        <!--Optional:-->  
        <v11:ValidateOnly>false</v11:ValidateOnly>  
        <!--Optional:-->  
        <v11:Payload> 
          <!--Optional:-->  
          <v11:ArrngId>NEW</v11:ArrngId>  
          <!--1 or more repetitions:-->  
          <v11:CustInfo> 
            <v11:CustId>STR</v11:CustId> 
          </v11:CustInfo>  
          <v11:ProdId>STR</v11:ProdId>  
          <v11:Ccy>STR</v11:Ccy>  
          <!--1 or more repetitions:-->  
          <v11:StlInfo> 
            <v11:DbAcctFlg>STR</v11:DbAcctFlg>  
            <v11:CrAcctFlg>STR</v11:CrAcctFlg>  
            <!--1 or more repetitions:-->  
            <v11:RefInfo> 
              <v11:DbAcctNo>STR</v11:DbAcctNo>  
              <v11:CrAcctNo>STR</v11:CrAcctNo> 
            </v11:RefInfo> 
          </v11:StlInfo> 
        </v11:Payload> 
      </v11:ServiceBody> 
    </v11:TDAcctOpnRq> 
  </soap:Body> 
</soap:Envelope>
